export const PasswordPatterns: { [key: string]: RegExp } = {
    letters: /^[а-яА-Яa-zA-Z]+$/,
    digits: /^\d+$/,
    symbols:  /^[!@#$%^&*()_+{}\[\]:;<>,.?~\\/-]+$/,
    lettersAndSymbols: /^(?=.*[а-яА-Яa-zA-Z])(?=.*[!@#$%^&*()_+{}\[\]:;<>,.?~\\/-])[а-яА-Яa-zA-Z!@#$%^&*()_+{}\[\]:;<>,.?~\\/-]+$/,
    digitsAndLetters: /^(?=.*[а-яА-Яa-zA-Z])(?=.*\d)[а-яА-Яa-zA-Z\d]+$/,
    symbolsAndDigits: /^(?=.*\d)(?=.*[!@#$%^&*()_+{}\[\]:;<>,.?~\\/-])[\d!@#$%^&*()_+{}\[\]:;<>,.?~\\/-]+$/,
    lettersAndDigitsAndSymbols: /^(?=.*[а-яА-Яa-zA-Z])(?=.*\d)(?=.*[!@#$%^&*()_+{}\[\]:;<>,.?~\\/-])[а-яА-Яa-zA-Z\d!@#$%^&*()_+{}\[\]:;<>,.?~\\/-]+$/,
}
